/*============================================================
        USART Function C V1.00
==============================================================
MCU: 						ATmega16L
CAN chip:       MAX232ACWE
Frequency:			7372800
Function: 			Define some function about USART
Writer:					Fenghui Zhu
Data:						2009-4-7
Reference:			
=============================================================*/

//********************* 
//* 头 文 件 配 置 区 * 
//*********************
#include "USART.h"


//********************** 
//*   函 数 声 明 区   * 
//**********************

//************************************************************* 
//   函数说明：字符输出函数
//   输入：    
//   输出：    无                     	                       
//   调用函数：	      						              
//*************************************************************
void USART_Transmit( unsigned char data )
{
// 等待发送缓冲器为空 
while ( !( UCSRA & (1<<UDRE)) )
;
// 将数据放入缓冲器，发送数据 
UDR = data;
}



//************************************************************* 
//   函数说明：字符接收函数
//   输入：    
//   输出：    无                     	                       
//   调用函数：	      						              
//************************************************************
unsigned char USART_Receive( void )
{
// 等待接收数据
while ( !(UCSRA & (1<<RXC)) )
;
// 从缓冲器中获取并返回数据
return UDR;
}
		
		
//************************************************************* 
//   函数说明：字符串输出函数
//   输入：    
//   输出：    无                     	                       
//   调用函数：	      						              
//************************************************************
int puts(char *s)
	{
	while (*s)
		{
		USART_Transmit(*s);
		s++;
		}	
    USART_Transmit(0x0a);//回车换行
//	putchar(0x0d);
	return 1;
	}
	
//************************************************************* 
//   函数说明：不含回车换行的字符串输出函数
//   输入：    
//   输出：    无                     	                       
//   调用函数：	      						              
//************************************************************
void putstr(char *s)
	{
	while (*s)
		{
		USART_Transmit(*s);
		s++;
		}	
	}	
	
//************************************************************* 
//   函数说明：固定字符串输出函数
//   输入：    
//   输出：    无                     	                       
//   调用函数：	      						              
//************************************************************
void putstr_L(char *s, unsigned char length)
	{
	while (length)
		{
		USART_Transmit(*s);
		s++;
		length--;
		}	
	}	

//************************************************************* 
//   函数说明：UART初始化
//   输入：    
//   输出：    无                     	                       
//   调用函数：	      						              
//************************************************************
void uart_init(void)
{

 UCSRB=(1<<RXEN)|(1<<TXEN);//允许发送和接收
 UBRRL=((fosc/16/(baud))-1)%256;			//Set baud
 UBRRH=((fosc/16/(baud))-1)/256;
 UCSRC=(1<<URSEL)|(1<<UCSZ1)|(1<<UCSZ0);//8位数据+1位STOP位
}


/*			RS232通信main函数		
void main(void)
{
 unsigned char i;
 port_init();
 uart_init(); 
 unsigned char j[]="Hello World!";
 while(1)
    {
	 i=USART_Receive();
	 USART_Transmit(i+1);
	 putstr(j);
	 switch (i)
	    {
		 case 0x31: PORTB |= 0x01; break;//第1个二极管亮
		 case 0x32: PORTB &= ~(0x01); break;//第1个二极管灭
		 case 0x33: PORTB |= 0x02; break;//第2个二极管亮
		 case 0x34: PORTB &= ~(0x02); break;//第2个二极管灭
	
		 default: break;
		}
	}
}

*/

